[
{"dataset_name": "Sentinel-2", "detail_url": "https://registry.opendata.aws/sentinel-2/", "tags": ["earth observation", "satellite imagery", "gis", "natural resource", "sustainability", "disaster response"], "description": "<p>The <a href=\"https://sentinel.esa.int/web/sentinel/missions/sentinel-2\">Sentinel-2 mission</a> is\na land monitoring constellation of two satellites that provide high resolution\noptical imagery and provide continuity for the current SPOT and Landsat missions.\nThe mission provides a global coverage of the Earth's land surface every 5 days,\nmaking the data of great use in on-going studies. L1C data are available from\nJune 2015 globally. L2A data are available from April 2017 over wider Europe\nregion, planned to be expanded globally in July 2018.</p>"},
{"dataset_name": "Landsat 8", "detail_url": "https://registry.opendata.aws/landsat-8/", "tags": ["earth observation", "satellite imagery", "gis", "natural resource", "sustainability", "disaster response"], "description": "<p>An ongoing collection of satellite imagery of all land on Earth produced by the Landsat 8 satellite.</p>"},
{"dataset_name": "IRS 990 Filings", "detail_url": "https://registry.opendata.aws/irs990/", "tags": ["regulatory", "statistics"], "description": "<p>Machine-readable data from certain electronic 990 forms filed with the IRS from 2011 to present.</p>"},
{"dataset_name": "SpaceNet on AWS", "detail_url": "https://registry.opendata.aws/spacenet/", "tags": ["gis", "computer vision", "machine learning", "earth observation", "disaster response"], "description": "<p>A corpus of commercial satellite imagery and labeled training data to foster innovation in the development of computer vision algorithms.</p>"},
{"dataset_name": "Terrain Tiles", "detail_url": "https://registry.opendata.aws/terrain-tiles/", "tags": ["elevation", "earth observation", "gis", "sustainability", "disaster response"], "description": "<p>A global dataset providing bare-earth terrain heights, tiled for easy usage and provided on S3.</p>"},
{"dataset_name": "Global Database of Events, Language and Tone (GDELT)", "detail_url": "https://registry.opendata.aws/gdelt/", "tags": ["events", "disaster response"], "description": "<p>This project monitors the world's broadcast, print,\nand web news from nearly every corner of every country in\nover 100 languages and identifies the people, locations,\norganizations, counts, themes, sources, emotions,\nquotes, images and events driving our global society every\nsecond of every day.</p>"},
{"dataset_name": "Common Crawl", "detail_url": "https://registry.opendata.aws/commoncrawl/", "tags": ["encyclopedic", "machine learning", "internet"], "description": "<p>A corpus of web crawl data composed of over 5 billion web pages.</p>"},
{"dataset_name": "GEOS-Chem Input Data", "detail_url": "https://registry.opendata.aws/geoschem-input-data/", "tags": ["climate", "weather", "meteorological", "environmental", "air quality", "sustainability"], "description": "<p>Input data for the GEOS-Chem Chemical Transport Model. Including the NASA/GMAO MERRA-2 and GEOS-FP <a href=\"http://wiki.seas.harvard.edu/geos-chem/index.php/Overview_of_GMAO_met_data_products\">meteorological products</a>, the <a href=\"http://wiki.seas.harvard.edu/geos-chem/index.php/HEMCO_data_directories\">HEMCO emission inventories</a>, and other small data such as <a href=\"http://wiki.seas.harvard.edu/geos-chem/index.php/GEOS-Chem_basics#Restart_files\">model initial conditions</a>.</p>"},
{"dataset_name": "MODIS on AWS", "detail_url": "https://registry.opendata.aws/modis/", "tags": ["gis", "satellite imagery", "natural resource", "sustainability", "disaster response"], "description": "<p>Select products from the Moderate Resolution Imaging Spectroradiometer (MODIS) managed by the U.S. Geological Survey and NASA.</p>"},
{"dataset_name": "OpenStreetMap on AWS", "detail_url": "https://registry.opendata.aws/osm/", "tags": ["mapping", "osm", "sustainability", "disaster response"], "description": "<p>OSM is a free, editable map of the world, created and maintained by volunteers. Regular OSM data archives are made available in Amazon S3.</p>"},
{"dataset_name": "Sentinel-1", "detail_url": "https://registry.opendata.aws/sentinel-1/", "tags": ["earth observation", "satellite imagery", "gis", "sustainability", "disaster response"], "description": "<p><a href=\"https://sentinel.esa.int/web/sentinel/missions/sentinel-1\">Sentinel-1</a> is a pair of European radar imaging (SAR) satellites launched in 2014 and 2016. Its 6 days revisit cycle and ability to observe through clouds makes it perfect for sea and land monitoring, emergency response due to environmental disasters, and economic applications.</p>"},
{"dataset_name": "Amazon Customer Reviews Dataset", "detail_url": "https://registry.opendata.aws/amazon-reviews/", "tags": ["natural language processing", "information retrieval", "machine learning"], "description": "<p>Amazon Customer Reviews (a.k.a. Product Reviews) is one of Amazon’s iconic products. In a period of over two decades since the first review in 1995, millions of Amazon customers have contributed over a hundred million reviews to express opinions and describe their experiences regarding products on the Amazon.com website. Over 130+ million customer reviews are available to researchers as part of this dataset.</p>"},
{"dataset_name": "CBERS on AWS", "detail_url": "https://registry.opendata.aws/cbers/", "tags": ["earth observation", "gis", "imaging", "satellite imagery", "sustainability", "disaster response"], "description": "<p>This project creates a S3 repository with imagery acquired\nby the China-Brazil Earth Resources Satellite (CBERS). The\nimage files are recorded and processed by Instituto Nacional de Pesquisa\nEspaciais (INPE) and are converted to Cloud Optimized Geotiff\nformat in order to optimize its use for cloud based applications.\nCurrently the repository contains all CBERS-4 MUX scenes acquired since\nthe start of the satellite mission. Scenes from CBERS-4 AWFI, PAN5M\nand PAN10M cameras acquired since Jun/2018 are also ingested daily,\nand the complete archive for these cameras will be ingested no later\nthan Sep/2018.</p>"},
{"dataset_name": "Deutsche Börse Public Dataset", "detail_url": "https://registry.opendata.aws/deutsche-boerse-pds/", "tags": ["market data", "financial markets", "trading"], "description": "<p>The Deutsche Börse Public Data Set consists of trade data aggregated to one minute intervals from the Eurex and Xetra trading systems. It provides the initial price, lowest price, highest price, final price and volume for every minute of the trading day, and for every tradeable security.  If you need higher resolution data, including untraded price movements, please refer to our historical market data product <a href=\"http://www.eurexchange.com/exchange-en/market-data/historical-data\">here</a>.  Also, be sure to check out our <a href=\"https://console.developer.deutsche-boerse.com/\">developer's portal</a>.</p>"},
{"dataset_name": "ECMWF ERA5 Reanalysis", "detail_url": "https://registry.opendata.aws/ecmwf-era5/", "tags": ["climate", "earth observation", "meteorological", "sustainability", "weather"], "description": "<p>ERA5 is the fifth generation of ECMWF atmospheric reanalyses of the global climate, and the first reanalysis produced as an operational service. It utilizes the best available observation data from satellites and in-situ stations, which are assimilated and processed using ECMWF's Integrated Forecast System (IFS) Cycle 41r2.\nThe dataset provides all essential atmospheric meteorological parameters like, but not limited to, air temperature, pressure and wind at different altitudes, along with surface parameters like rainfall, soil moisture content and sea parameters like sea-surface temperature and wave height.\nERA5 provides data at a considerably higher spatial and temporal resolution than its legacy counterpart ERA-Interim. ERA5 consists of high resolution version with 31 km horizontal resolution, and a reduced resolution ensemble version with 10 members. It is currently available since 2008, but will be continuously extended backwards, first until 1979 and then to 1950.\nLearn more about ERA5 in Jon Olauson's paper <a href=\"https://www.researchgate.net/publication/320084119_ERA5_The_new_champion_of_wind_power_modelling\">ERA5: The new champion of wind power modelling?</a>.</p>"},
{"dataset_name": "Hubble Space Telescope Public Data", "detail_url": "https://registry.opendata.aws/hst/", "tags": ["astronomy"], "description": "<p>The Hubble Space Telescope (HST) is one of the most productive scientific instruments ever created. This dataset contains calibrated and raw data for all of the currently active instruments on HST: ACS, COS, STIS and WFC3. </p>"},
{"dataset_name": "NAIP on AWS", "detail_url": "https://registry.opendata.aws/naip/", "tags": ["earth observation", "aerial imagery", "gis", "natural resource", "regulatory", "sustainability"], "description": "<p>The National Agriculture Imagery Program (NAIP) acquires aerial imagery during the agricultural growing seasons in the continental U.S. This \"leaf-on\" imagery andtypically ranges from 60 centimeters to 100 centimeters in resolutionand is available from the naip-analytic Amazon S3 bucket as 4-band (RGB + NIR) imagery in MRF format, on naip-source Amazon S3 bucket as 4-band (RGB + NIR) in uncompressed Raw GeoTiff format and naip-visualization as 3-band (RGB) Cloud Optimized GeotTiff format. NAIP data is delivered at the state level; every year, a number of states receive updates, with an overall update cycle of two or three years. More details on <a href=\"https://www.fsa.usda.gov/programs-and-services/aerial-photography/imagery-programs/naip-imagery/\">NAIP</a></p>"},
{"dataset_name": "NASA NEX", "detail_url": "https://registry.opendata.aws/nasanex/", "tags": ["earth observation", "natural resource", "climate", "sustainability"], "description": "<p>A collection of Earth science datasets maintained by NASA, including climate change projections and satellite images of the Earth's surface.</p>"},
{"dataset_name": "NEXRAD on AWS", "detail_url": "https://registry.opendata.aws/noaa-nexrad/", "tags": ["earth observation", "natural resource", "weather", "meteorological", "sustainability"], "description": "<p>Real-time and archival data from the Next Generation Weather Radar (NEXRAD) network.</p>"},
{"dataset_name": "New York City Taxi and Limousine Commission (TLC) Trip Record Data", "detail_url": "https://registry.opendata.aws/nyc-tlc-trip-records-pds/", "tags": ["cities", "urban", "transportation"], "description": "<p>Data of trips taken by taxis and for-hire vehicles in New York City.</p>"},
{"dataset_name": "1000 Genomes", "detail_url": "https://registry.opendata.aws/1000-genomes/", "tags": ["genetic", "genomic", "life sciences"], "description": "<p>The 1000 Genomes Project is an international collaboration which has established the most detailed catalogue of human genetic variation, including SNPs, structural variants, and their haplotype context. The final phase of the project sequenced more than 2500 individuals from 26 different populations around the world and produced an integrated set of phased haplotypes with more than 80 million variants for these individuals.</p>"},
{"dataset_name": "Allen Brain Observatory - Visual Coding AWS Public Data Set", "detail_url": "https://registry.opendata.aws/allen-brain-observatory/", "tags": ["neurobiology", "neuro imaging", "image processing", "machine learning", "life sciences"], "description": "<p>The Allen Brain Observatory – Visual Coding is the first standardized in vivo survey of physiological activity in the mouse visual cortex, featuring representations of visually evoked calcium responses from GCaMP6-expressing neurons in selected cortical layers, visual areas, and Cre lines.</p>"},
{"dataset_name": "Amazon Bin Image Dataset", "detail_url": "https://registry.opendata.aws/amazon-bin-imagery/", "tags": ["computer vision", "machine learning"], "description": "<p>The Amazon Bin Image Dataset contains over 500,000 images and metadata from bins of a pod in an operating Amazon Fulfillment Center. The bin images in this dataset are captured as robot units carry pods as part of normal Amazon Fulfillment Center operations.</p>"},
{"dataset_name": "Cornell EAS Data Lake", "detail_url": "https://registry.opendata.aws/cornell-eas-data-lake/", "tags": ["agriculture", "climate", "earth observation", "elevation", "environmental", "gis", "mapping", "meteorological", "sustainability", "weather"], "description": "<p>Earth &amp; Atmospheric Sciences at Cornell University has created a public data  lake of climate data. The data is stored in columnar storage formats (ORC) to  make it straightforward to query using standard tools like Amazon  Athena or Apache Spark. The data itself is originally intended to be used for  building decision support tools for farmers and digital agriculture. The first  dataset is the historical NDFD / NDGD data distributed by NCEP / NOAA / NWS.  The NDFD (National Digital Forecast Database) and NDGD (National Digital Guidance Database)  contain gridded forecasts and observations at 2.5km resolution for the Contiguous  United States (CONUS). There are also 5km grids for several smaller US regions and  non-continguous territories, such as Hawaii, Guam, Puerto Rico and Alaska. NOAA  distributes archives of the NDFD/NDGD via its NOAA Operational Model Archive and Distribution System (NOMADS)  in Grib2 format. The data has been converted to ORC to optimize storage space and to, more importantly, simplify data access via standard data analytics tools.</p>"},
{"dataset_name": "OpenAQ", "detail_url": "https://registry.opendata.aws/openaq/", "tags": ["air quality", "cities", "environmental", "gis", "sustainability"], "description": "<p>Global, aggregated physical air quality data from public data sources provided by government, research-grade and other sources. These awesome groups do the hard work of measuring these data and publicly sharing them, and our community makes them more universally-accessible to both humans and machines.</p>"},
{"dataset_name": "TCGA on AWS", "detail_url": "https://registry.opendata.aws/tcga/", "tags": ["cancer", "genomic", "life sciences"], "description": "<p>The Cancer Genome Atlas (TCGA) is a joint effort of the National Cancer Institute (NCI) and the National Human Genome Research Institute (NHGRI) to accelerate our understanding of the molecular basis of cancer. TCGA-funded researchers across the United States have produced a corpus of raw and processed genomic, transcriptomic, and epigenomic data from thousands of cancer patients.</p>"},
{"dataset_name": "U.S. Census ACS PUMS", "detail_url": "https://registry.opendata.aws/census-dataworld-pums/", "tags": ["statistics", "census", "survey", "sustainability"], "description": "<p>U.S. Census Bureau American Community Survey (ACS) Public Use Microdata Sample (PUMS) available in a linked data format using the Resource Description Framework (RDF) data model.</p>"},
{"dataset_name": "USAspending.gov", "detail_url": "https://registry.opendata.aws/usaspending/", "tags": ["regulatory", "economics", "statistics", "us"], "description": "<p>USAspending.gov database, which includes data on all spending by the federal government, including contracts, grants, loans, employee salaries, and more.</p>"},
{"dataset_name": "Voices Obscured in Complex Enrivonmental Settings (VOiCES)", "detail_url": "https://registry.opendata.aws/lab41-sri-voices/", "tags": ["machine learning", "automatic speech recognition", "speaker identification", "denoising", "speech processing"], "description": "<p>VOiCES is a speech corpus recorded in acoustically challenging settings,\nusing distant microphone recording. Speech was recorded in real rooms with various\nacoustic features (reverb, echo, HVAC systems, outside noise, etc.). Adversarial noise,\neither television, music, or babble, was concurrently played with clean speech.\nData was recorded using multiple microphones strategically placed\nthroughout the room. The corpus includes audio recordings, orthographic transcriptions,\nand speaker labels.</p>"},
{"dataset_name": "3000 Rice Genomes Project", "detail_url": "https://registry.opendata.aws/3kricegenome/", "tags": ["agriculture", "food security", "genetic", "genomic", "life sciences"], "description": "<p>The 3000 Rice Genome Project is an international effort to sequence the genomes of 3,024 rice varieties from 89 countries.</p>"},
{"dataset_name": "CCAFS-Climate Data", "detail_url": "https://registry.opendata.aws/cgiardata/", "tags": ["agriculture", "food security", "climate", "sustainability"], "description": "<p>High resolution climate data to help assess the impacts of climate change primarily on agriculture. These open access datasets of climate projections will help researchers make climate change impact assessments.</p>"},
{"dataset_name": "District of Columbia - Classified Point Cloud LiDAR", "detail_url": "https://registry.opendata.aws/dc-lidar-2015/", "tags": ["gis", "cities", "us-dc", "disaster response"], "description": "<p>LiDAR point cloud data for Washington, DC is available for anyone to use on Amazon S3.\nThis dataset, managed by the Office of the Chief Technology Officer (OCTO), through the\ndirection of the District of Columbia GIS program, contains tiled point cloud data for\nthe entire District along with associated metadata.</p>"},
{"dataset_name": "EPA Risk-Screening Environmental Indicators", "detail_url": "https://registry.opendata.aws/epa-rsei-pds/", "tags": ["environmental", "sustainability"], "description": "<p>Detailed air model results from EPA’s Risk-Screening Environmental Indicators (RSEI) model.</p>"},
{"dataset_name": "GOES on AWS", "detail_url": "https://registry.opendata.aws/noaa-goes/", "tags": ["gis", "weather", "earth observation", "meteorological", "sustainability", "disaster response"], "description": "<p>GOES provides continuous weather imagery and monitoring of meteorological and space environment data across North America.</p>"},
{"dataset_name": "Genome in a Bottle on AWS", "detail_url": "https://registry.opendata.aws/giab/", "tags": ["genomic", "life sciences"], "description": "<p>Several reference genomes to enable translation of whole human genome sequencing to clinical practice.</p>"},
{"dataset_name": "Global Surface Summary of Day", "detail_url": "https://registry.opendata.aws/noaa-gsod/", "tags": ["environmental", "climate", "weather", "natural resource", "regulatory", "sustainability"], "description": "<p>GSOD is a collection of daily weather measurements (temperature, wind speed, humidity, pressure, and more) from 9000+ weather stations around the world.</p>"},
{"dataset_name": "Google Books Ngrams", "detail_url": "https://registry.opendata.aws/google-ngrams/", "tags": ["natural language processing"], "description": "<p>N-grams are fixed size tuples of items. In this case the items are words extracted from the Google Books corpus. The n specifies the number of elements in the tuple, so a 5-gram contains five words or characters. The n-grams in this dataset were produced by passing a sliding window of the text of books and outputting a record for each new token.</p>"},
{"dataset_name": "HIRLAM Weather Model", "detail_url": "https://registry.opendata.aws/hirlam/", "tags": ["earth observation", "climate", "weather", "meteorological", "sustainability"], "description": "<p>HIRLAM (High Resolution Limited Area Model) is an operational synoptic and mesoscale weather prediction model managed by the Finnish Meteorological Institute.</p>"},
{"dataset_name": "ICGC on AWS", "detail_url": "https://registry.opendata.aws/icgc/", "tags": ["cancer", "genomic", "life sciences"], "description": "<p>The International Cancer Genome Consortium (ICGC) coordinates projects with the common aim of accelerating research into the causes and control of cancer. The PanCancer Analysis of Whole Genomes (PCAWG) study is an international collaboration to identify common patterns of mutation in whole genomes from ICGC. More than 2,400 consistently analyzed genomes corresponding to over 1,100 unique ICGC donors are now freely available on Amazon S3 to credentialed researchers subject to ICGC data sharing policies.</p>"},
{"dataset_name": "Multimedia Commons", "detail_url": "https://registry.opendata.aws/multimedia-commons/", "tags": ["computer vision", "machine learning", "multimedia"], "description": "<p>The Multimedia Commons is a collection of audio and visual features computed for the nearly 100 million Creative Commons-licensed Flickr images and videos in the YFCC100M dataset from Yahoo! Labs, along with ground-truth annotations for selected subsets. The International Computer Science Institute (ICSI) and Lawrence Livermore National Laboratory are producing and distributing a core set of derived feature sets and annotations as part of an effort to enable large-scale video search capabilities. They have released this feature corpus into the public domain, under Creative Commons License 0, so it is free for anyone to use for any purpose.</p>"},
{"dataset_name": "NOAA Global Forecast System (GFS) Model", "detail_url": "https://registry.opendata.aws/noaa-gfs-pds/", "tags": ["climate", "weather", "environmental", "sustainability", "disaster response"], "description": "<p>The Global Forecast System (GFS) is a weather forecast model produced by the National Centers for Environmental Prediction (NCEP). Dozens of atmospheric and land-soil variables are available through this dataset, from temperatures, winds, and precipitation to soil moisture and atmospheric ozone concentration. The entire globe is covered by the GFS at a base horizontal resolution of 18 miles (28 kilometers) between grid points, which is used by the operational forecasters who predict weather out to 16 days in the future. Horizontal resolution drops to 44 miles (70 kilometers) between grid point for forecasts between one week and two weeks.</p>"},
{"dataset_name": "NOAA Global Historical Climatology Network Daily (GHCN-D)", "detail_url": "https://registry.opendata.aws/noaa-ghcn/", "tags": ["climate", "meteorological", "sustainability", "weather"], "description": "<p>Global Historical Climatology Network - Daily is a dataset from NOAA that contains daily observations over global land areas. It contains station-based measurements from land-based stations worldwide, about two thirds of which are for precipitation measurement only. Other meteorological elements include, but are not limited to, daily maximum and minimum temperature, temperature at the time of observation, snowfall and snow depth. It is a composite of climate records from numerous sources that were merged together and subjected to a common suite of quality assurance reviews.  Some data are more than 175 years old. The data is in CSV format. Each file corresponds to a year from 1763 to present and is named as such.</p>"},
{"dataset_name": "NOAA High-Resolution Rapid Refresh (HRRR) Model", "detail_url": "https://registry.opendata.aws/noaa-hrrr-pds/", "tags": ["climate", "weather", "environmental", "sustainability", "disaster response"], "description": "<p>The HRRR is a NOAA real-time 3-km resolution, hourly updated, cloud-resolving, convection-allowing atmospheric model, initialized by 3km grids with 3km radar assimilation. Radar data is assimilated in the HRRR every 15 min over a 1-h period adding further detail to that provided by the hourly data assimilation from the 13km radar-enhanced Rapid Refresh.</p>"},
{"dataset_name": "NOAA National Water Model Reanalysis", "detail_url": "https://registry.opendata.aws/nwm-archive/", "tags": ["weather", "climate", "environmental", "disaster response", "agriculture", "transportation", "sustainability"], "description": "<p>The NOAA National Water Model Reanalysis dataset contains output from a 25-year retrospective simulation (January 1993 through December 2017) of version 1.2 of the National Water Model. This simulation used observed rainfall as input and ingested other required meteorological input fields from a weather Reanalysis dataset. The output frequency and fields available in this historical NWM dataset differ from those contained in the real-time forecast model. One application of this dataset is to provide historical context to current real-time streamflow, soil moisture and snowpack NWM conditions. The Reanalysis data can be used to infer flow frequencies and perform temporal analyses with hourly streamflow output and 3-hourly land surface output. The long-term dataset can also be used in the development of end user applications which require a long baseline of data for system training or verification purposes.</p>"},
{"dataset_name": "NOAA National Water Model Short-Range Forecast", "detail_url": "https://registry.opendata.aws/noaa-nwm-pds/", "tags": ["weather", "climate", "environmental", "disaster response", "agriculture", "transportation", "sustainability"], "description": "<p>The National Water Model (NWM) is a water resources model that simulates and forecasts water\nbudget variables, including snowpack, evapotranspiration, soil moisture and streamflow, over\nthe entire continental United States (CONUS). The model, launched in August 2016, is designed\nto improve the ability of NOAA to meet the needs of its stakeholders (forecasters, emergency\nmanagers, reservoir operators, first responders, recreationists, farmers, barge operators, and\necosystem and floodplain managers) by providing expanded accuracy, detail, and frequency of water\ninformation. It is operated by NOAA’s Office of Water Prediction. This bucket contains a four-week\nrollover of the Short Range Forecast model output and the corresponding forcing data for the\nmodel. The model is forced with meteorological data from the High Resolution Rapid Refresh (HRRR)\nand the Rapid Refresh (RAP) models. The Short Range Forecast configuration cycles hourly and produces\nhourly deterministic forecasts of streamflow and hydrologic states out to 18 hours.</p>"},
{"dataset_name": "Nanopore Reference Human Genome", "detail_url": "https://registry.opendata.aws/nanopore/", "tags": ["genomic", "life sciences"], "description": "<p>This dataset includes the sequencing and assembly of a reference standard human genome (GM12878) using the MinION nanopore sequencing instrument with the R9.4 1D chemistry.</p>"},
{"dataset_name": "Open Observatory of Network Interference", "detail_url": "https://registry.opendata.aws/ooni/", "tags": ["internet"], "description": "<p>A free software, global observation network for detecting censorship, surveillance and traffic manipulation on the internet.</p>"},
{"dataset_name": "OpenNeuro", "detail_url": "https://registry.opendata.aws/openneuro/", "tags": ["biology", "imaging", "neurobiology", "neuro imaging"], "description": "<p>OpenNeuro is a database of openly-available brain imaging data. The data are shared according to a Creative Commons CC0 license, providing a broad range of brain imaging data to researchers and citizen scientists alike. The database primarily focuses on functional magnetic resonance imaging (fMRI) data, but also includes other imaging modalities including structural and diffusion MRI, electroencephalography (EEG), and magnetoencephalograpy (MEG). OpenfMRI is a project of the <a href=\"http://reproducibility.stanford.edu\">Center for Reproducible Neuroscience at Stanford University</a>. Development of the OpenfMRI resource has been funded by the National Science Foundation, National Institute on Drug Abuse, and the Laura and John Arnold Foundation.</p>"},
{"dataset_name": "OpenStreetMap Linear Referencing", "detail_url": "https://registry.opendata.aws/osmlr/", "tags": ["gis", "traffic", "osm", "sustainability", "disaster response"], "description": "<p>OSMLR a linear referencing system built on top of OpenStreetMap. OSM has great information about roads around the world and their interconnections, but it lacks the means to give a stable identifier to a stretch of roadway. OSMLR provides a stable set of numerical IDs for every 1 kilometer stretch of roadway around the world. In urban areas, OSMLR IDs are attached to each block of roadways between significant intersections.</p>"},
{"dataset_name": "Physionet", "detail_url": "https://registry.opendata.aws/physionet/", "tags": ["biology", "life sciences"], "description": "<p>PhysioNet offers free web access to large collections of recorded physiologic signals (PhysioBank) and related open-source software (PhysioToolkit).</p>"},
{"dataset_name": "Rapid7 FDNS ANY Dataset", "detail_url": "https://registry.opendata.aws/rapid7-fdns-any/", "tags": ["computer security", "cyber security", "analytics", "internet"], "description": "<p>Subset of FDNS ANY queries against domain names produced by <a href=\"https://www.rapid7.com\">Rapid7</a> Project Sonar, made available in s3.\nMore information on the schema can be found at Rapid7's <a href=\"https://opendata.rapid7.com/sonar.fdns_v2/\">Open Data website</a>.</p>"},
{"dataset_name": "The Genome Modeling System", "detail_url": "https://registry.opendata.aws/gmsdata/", "tags": ["genetic", "genomic", "life sciences"], "description": "<p>The Genome Institute at Washington University has developed a high-throughput, fault-tolerant analysis information management system called the Genome Modeling System (GMS), capable of executing complex, interdependent, and automated genome analysis pipelines at a massive scale. The GMS framework provides detailed tracking of samples and data coupled with reliable and repeatable analysis pipelines. GMS includes a full system image with software and services, expandable from one workstation to a large compute cluster.</p>"},
{"dataset_name": "The Human Connectome Project", "detail_url": "https://registry.opendata.aws/hcp-openaccess/", "tags": ["neuro imaging", "life sciences"], "description": "<p>The Human Connectome Project aims to provide an unparalleled compilation of neural data, an interface to graphically navigate this data and the opportunity to achieve never before realized conclusions about the living human brain.</p>"},
{"dataset_name": "The Human Microbiome Project", "detail_url": "https://registry.opendata.aws/human-microbiome-project/", "tags": ["life sciences"], "description": "<p>The NIH-funded Human Microbiome Project (HMP) is a collaborative effort of over 300 scientists from more than 80 organizations to comprehensively characterize the microbial communities inhabiting the human body and elucidate their role in human health and disease. To accomplish this task, microbial community samples were isolated from a cohort of 300 healthy adult human subjects at 18 specific sites within five regions of the body (oral cavity, airways, urogenital track, skin, and gut). Targeted sequencing of the 16S bacterial marker gene and/or whole metagenome shotgun sequencing was performed for thousands of these samples. In addition, whole genome sequences were generated for isolate strains collected from human body sites to act as reference organisms for analysis. Finally, 16S marker and whole metagenome sequencing was also done on additional samples from people suffering from several disease conditions.</p>"},
{"dataset_name": "UK Met Office Global and Regional Weather Forecasts", "detail_url": "https://registry.opendata.aws/mogreps/", "tags": ["earth observation", "climate", "weather", "meteorological", "sustainability"], "description": "<p>Archive data from the UK Met Office Global and Regional Ensemble Prediction System (MOGREPS) available on Amazon S3. Data from two models is available: MOEGREPS-UK, a high resolution weather forecast covering the United Kingdom, and MOGREPS-G, a global weather forecast.</p>"},
{"dataset_name": "American Ninja Warrior Obstacle History", "detail_url": "https://registry.opendata.aws/america-ninja-warrior/", "tags": ["multimedia", "events", "sports"], "description": "<p>Obstacle history of American Ninja Warrior seasons 1-9\nThis dataset includes every obstacle in the history of American Ninja Warrior from season 1 to 9. This includes the obstacles at Sasuke (also known as the original Ninja Warrior in Japan) during seasons 1-3 when American Ninja Warrior (ANW) was on G4, and the top 10 competitors from the semi-finals round of ANW were sent to Sasuke to compete. Starting in season 4 of ANW, which is known as the \"NBC era\" when the show took on the regional/city formats for both qualifying and semi-final rounds with the finalists from each region competing at the National Finals of ANW in Las Vegas.</p>"},
{"dataset_name": "Collection of daily coin data from Coin Metrics", "detail_url": "https://registry.opendata.aws/daily-coin-data/", "tags": ["financial markets", "economics", "bitcoin", "blockchain"], "description": "<p>This project is set to pull the latest daily coin data from Coin Metrics using the data.world sync applet on IFTTT.\nDaily on-chain transaction volume is calculated as the sum of all transaction outputs belonging to the blocks mined on the given day. \"Change\" outputs are not included.\nTransaction count figure doesn’t include coinbase transactions.</p>"},
{"dataset_name": "Federal Government Awards", "detail_url": "https://registry.opendata.aws/federal-government-awards/", "tags": ["census", "government spending", "regulatory", "us"], "description": "<p>The Federal Awards dataset contains a complete export of the data available from USASpending. This dataset reflects all observations submitted through the third quarter of fiscal year 2017.</p>"},
{"dataset_name": "Linguistic data of 32k film subtitles with IMDb meta-data", "detail_url": "https://registry.opendata.aws/imdb/", "tags": ["natural language processing", "multimedia", "media", "movies", "subtitles", "sentiment", "text analysis"], "description": "<p>Meta-data for more than 32 thousand films. These meta-data are matched to word-count categories from subtitle files.</p>"},
{"dataset_name": "Medicare Drug Spending", "detail_url": "https://registry.opendata.aws/medicare-drug-spending/", "tags": ["pharmaceutical", "statistics", "us"], "description": "<p>Finding ways to make Medicare drug spending data more consumable.</p>"},
{"dataset_name": "NFA 2017 - Ecological Resource Use and Resource Capacity of Nations from 1961 to 2013", "detail_url": "https://registry.opendata.aws/nfa/", "tags": ["environmental", "climate", "economics", "life sciences", "sustainability"], "description": "<p>Our National Footprint Accounts (NFAs) measure the ecological resource use and resource capacity of nations from 1961 to 2013.\nThe calculations in the National Footprint Accounts are primarily based on United Nations data sets, including those published by the Food and Agriculture Organization, United Nations Commodity Trade Statistics Database, and the UN Statistics Division, as well as the International Energy Agency.</p>"},
{"dataset_name": "Swiss Public Transport Stops", "detail_url": "https://registry.opendata.aws/schweizer-haltestellen-oev/", "tags": ["cities", "gis", "infrastructure", "mapping", "traffic", "transportation"], "description": "<p>The basic geo-data set for public transport stops comprises public transport stops in Switzerland and additional selected geo-referenced public transport locations that are of operational or structural importance (operating points).</p>"},
{"dataset_name": "Translated Sacred Text Word Counts", "detail_url": "https://registry.opendata.aws/sacred-word-counts/", "tags": ["natural language processing", "machine learning"], "description": "<p>Counts of words used in English-language translations of sacred texts, with flag for common words.</p>"},
{"dataset_name": "DigitalGlobe Open Data Program", "detail_url": "https://registry.opendata.aws/digital-globe-open-data/", "tags": ["earth observation", "disaster response", "gis", "satellite imagery", "sustainability"], "description": "<p>Pre and post event high-resolution satellite imagery in support of emergency planning, risk assessment, monitoring of staging areas and emergency response, damage assessment, and recovery. Also incudes crowdsourced damage assessments for major, sudden onset disasters.</p>"}
]